v9/phaseChangeColumn/cavitation/1x640/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                   
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (liquid vapour air);

phaseChangeThreePhaseMixture SchnerrSauer3;

pSat        100300;

liquid
{
    transportModel  Newtonian;
    nu         0.01;
    rho        1000;       
}

vapour
{
    transportModel  Newtonian;
    nu         0.1;
    rho        1;    
}

air
{
    transportModel  Newtonian;
    nu         0.1;
    rho        1;          
}


SchnerrSauer3Coeffs
{
    n               1e+8;
    dNuc            1e-6;
    Cc              0;
    Cv              1;
}

sigma12         1.96;
sigma13         1.96; 

//Used for interFoam in the initial setup of the case to get 2 separate logfiles for the setInitP and solveign
sigma 1.96;
// ************************************************************************* //
