v9/phaseChangeColumn/cavitation/1x640/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
 =========                |
 \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
  \    /   O peration     | Website:  https://openfoam.org
   \  /    A nd           | Version:  9                                   
    \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
    version     2.0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default CrankNicolson 0;
}

gradSchemes
{
    default Gauss linear;

}

divSchemes
{
    div(phi,alpha)    		Gauss noInterfaceCompression vanLeer;
    div(rhoPhi,U)           Gauss linearUpwindV grad(U);
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default          Gauss linear corrected;
}

interpolationSchemes
{
    default          linear;
}

snGradSchemes
{
    default          corrected;
}

fluxRequired
{
    default no;
    p_rgh;
    pcorr;
    alpha.liquid;
    alpha.air;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
